In [ ]:
1+2

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
##Creating a series

In [4]:
labels = ['a','b','c']
my_arr= np.array([1,2,3])
my_dict={1:10,2:33,3:34}

In [5]:
pd.Series(my_arr)

0    1
1    2
2    3
dtype: int64

In [6]:
pd.Series(my_arr, labels)

a    1
b    2
c    3
dtype: int64

In [7]:
pd.Series(my_dict)

1    10
2    33
3    34
dtype: int64

In [ ]:
import numpy as np
import pandas as pd

In [2]:
data = {
    "Name": ["John", "Anna", "Peter", "Linda"],
    "Age": [28, 34, 29, 42],
    "City": ["New York", "Paris", "Berlin", "London"],
    "Salary": [65000, 70000, 62000, 85000],
}
df = pd.DataFrame(data)

In [3]:
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [4]:
data_list = [
    ["John", 28, "New York", 65000],
    ["Anna", 34, "Paris", 70000],
    ["Peter", 29, "Berlin", 62000],
    ["Linda", 42, "London", 85000],
]
df2 = pd.DataFrame(data_list)
columns = ["Name", "Age", "City", "Salary"]
df2 = pd.DataFrame(data_list, columns=columns)
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [6]:
df2['Name']

0     John
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object

In [9]:
df2[['Name','City']]

    Name      City
0   John  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

In [10]:
df2['Designation']=["doctor","eng","eng","doctor"]

In [11]:
df2

    Name  Age      City  Salary Designation
0   John   28  New York   65000      doctor
1   Anna   34     Paris   70000         eng
2  Peter   29    Berlin   62000         eng
3  Linda   42    London   85000      doctor

In [16]:
# from sqlalchemy import true


df2.drop('Designation',axis=1,inplace=True)

In [17]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [20]:
df2.drop(0 ,axis=0)

    Name  Age    City  Salary
1   Anna   34   Paris   70000
2  Peter   29  Berlin   62000
3  Linda   42  London   85000

In [22]:
df2.loc[0]

Name          John
Age             28
City      New York
Salary       65000
Name: 0, dtype: object

In [23]:
df2.loc[[0,1]]

   Name  Age      City  Salary
0  John   28  New York   65000
1  Anna   34     Paris   70000

In [24]:
df2.iloc[1]

Name       Anna
Age          34
City      Paris
Salary    70000
Name: 1, dtype: object

In [26]:
df.loc[[0,1]][['Age','City']]

   Age      City
0   28  New York
1   34     Paris

In [28]:
# conditional selection
df2[df2['Age']>30]

    Name  Age    City  Salary
1   Anna   34   Paris   70000
3  Linda   42  London   85000

In [32]:
df2[(df2["Age"] > 30) & (df2["City"] == "Paris")]

   Name  Age   City  Salary
1  Anna   34  Paris   70000

In [33]:
data = {
    "A": [1, 2, np.nan, 4, 5],
    "B": [1, 2, 3, 4, 5],
    "C": [1, 2, 3, np.nan, np.nan],
    "D": [1, np.nan, np.nan, np.nan, 5],
}
df = pd.DataFrame(data)

In [34]:
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [36]:
df.isna().sum()

A    1
B    0
C    2
D    3
dtype: int64

In [37]:
df.isna().any()

A     True
B    False
C     True
D     True
dtype: bool

In [38]:
df.dropna()

     A  B    C    D
0  1.0  1  1.0  1.0

In [ ]:
df.dropna(thresh=3) ## how many non NULL values should be there in one ROW

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
4  5.0  5  NaN  5.0

In [ ]:
df.fillna(0) ## filling missing values

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  0.0
2  0.0  3  3.0  0.0
3  4.0  4  0.0  0.0
4  5.0  5  0.0  5.0

In [42]:
values = {"A": 0, "B": 100, "C": 300, "D": 400}
df.fillna(value=values)

     A  B      C      D
0  1.0  1    1.0    1.0
1  2.0  2    2.0  400.0
2  0.0  3    3.0  400.0
3  4.0  4  300.0  400.0
4  5.0  5  300.0    5.0

In [43]:
df.fillna(df.mean())

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  3.0
2  3.0  3  3.0  3.0
3  4.0  4  2.0  3.0
4  5.0  5  2.0  5.0

In [44]:
employees = pd.DataFrame(
    {
        "employee_id": [1, 2, 3, 4, 5],
        "name": ["John", "Anna", "Peter", "Linda", "Bob"],
        "department": ["HR", "IT", "Finance", "IT", "HR"],
    }
)

# DataFrame 2: Salary information
salaries = pd.DataFrame(
    {
        "employee_id": [1, 2, 3, 6, 7],
        "salary": [60000, 80000, 65000, 70000, 90000],
        "bonus": [5000, 10000, 7000, 8000, 12000],
    }
)

In [45]:
salaries

   employee_id  salary  bonus
0            1   60000   5000
1            2   80000  10000
2            3   65000   7000
3            6   70000   8000
4            7   90000  12000

In [46]:
employees

   employee_id   name department
0            1   John         HR
1            2   Anna         IT
2            3  Peter    Finance
3            4  Linda         IT
4            5    Bob         HR

In [53]:
pd.merge(employees, salaries, on="employee_id",how="inner")

   employee_id   name department  salary  bonus
0            1   John         HR   60000   5000
1            2   Anna         IT   80000  10000
2            3  Peter    Finance   65000   7000

In [54]:
pd.merge(employees, salaries, on="employee_id", how="outer")

   employee_id   name department   salary    bonus
0            1   John         HR  60000.0   5000.0
1            2   Anna         IT  80000.0  10000.0
2            3  Peter    Finance  65000.0   7000.0
3            4  Linda         IT      NaN      NaN
4            5    Bob         HR      NaN      NaN
5            6    NaN        NaN  70000.0   8000.0
6            7    NaN        NaN  90000.0  12000.0

In [55]:
pd.merge(employees, salaries, on="employee_id", how="left")

   employee_id   name department   salary    bonus
0            1   John         HR  60000.0   5000.0
1            2   Anna         IT  80000.0  10000.0
2            3  Peter    Finance  65000.0   7000.0
3            4  Linda         IT      NaN      NaN
4            5    Bob         HR      NaN      NaN

In [56]:
pd.merge(employees, salaries, on="employee_id", how="right")

   employee_id   name department  salary  bonus
0            1   John         HR   60000   5000
1            2   Anna         IT   80000  10000
2            3  Peter    Finance   65000   7000
3            6    NaN        NaN   70000   8000
4            7    NaN        NaN   90000  12000

In [57]:
df1 = pd.DataFrame(
    {"A": ["A0", "A1", "A2"], "B": ["B0", "B1", "B2"], "C": ["C0", "C1", "C2"]}
)

df2 = pd.DataFrame(
    {"A": ["A3", "A4", "A5"], "B": ["B3", "B4", "B5"], "C": ["C3", "C4", "C5"]}
)

In [59]:
pd.concat([df1,df2])

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [60]:
pd.concat([df1, df2], axis=1)

    A   B   C   A   B   C
0  A0  B0  C0  A3  B3  C3
1  A1  B1  C1  A4  B4  C4
2  A2  B2  C2  A5  B5  C5

In [61]:
df1 = pd.DataFrame({"name": ["Alice", "Bob", "Charlie"]}, index=[1, 2, 3])

# Second DataFrame
df2 = pd.DataFrame({"score": [85, 90, 75]}, index=[2, 3, 4])

In [62]:
df1.join(df2, how="outer")

      name  score
1    Alice    NaN
2      Bob   85.0
3  Charlie   90.0
4      NaN   75.0

In [63]:
df2.join(df1)

   score     name
2     85      Bob
3     90  Charlie
4     75      NaN

In [65]:
data = {
    "Category": ["A", "B", "A", "B", "A", "B", "A", "B"],
    "Store": ["S1", "S1", "S2", "S2", "S1", "S2", "S2", "S1"],
    "Sales": [100, 200, 150, 250, 120, 180, 200, 300],
    "Quantity": [10, 15, 12, 18, 8, 20, 15, 25],
    "Date": pd.date_range("2023-01-01", periods=8),
}
df = pd.DataFrame(data)

In [68]:
df.groupby('Category')['Sales'].sum()

Category
A    570
B    930
Name: Sales, dtype: int64

In [69]:
df.groupby("Store")["Sales"].sum()

Store
S1    720
S2    780
Name: Sales, dtype: int64

In [70]:
df.groupby(["Store","Category"])["Sales"].sum()

Store  Category
S1     A           220
       B           500
S2     A           350
       B           430
Name: Sales, dtype: int64

In [71]:
df['Sales'].mean()

np.float64(187.5)

In [73]:
df['Sales'].agg(["mean","median"])

mean      187.5
median    190.0
Name: Sales, dtype: float64

In [77]:
def square(x:int):
    return x**2

In [78]:
df1 = pd.DataFrame(
    {"A": [1, 2, 3, 4, 5], "B": [10, 20, 30, 40, 50], "C": [100, 200, 300, 400, 500]}
)

In [ ]:
df1['A'].apply(square) ## apply transformation on a column

0     1
1     4
2     9
3    16
4    25
Name: A, dtype: int64